"projects": [
  {
    "name": "UniConnect",
    "startDate": "2025-09-01",
    "isActive": true,
    "endDate": "",
    "description": "A modern social network platform designed for university students, built from scratch using Node.js, Express, MySQL, and TailwindCSS. UniConnect allows students to connect, share posts, and interact within an academic-oriented community.",
    "highlights": [
      "Developed full-stack architecture with Node.js, Express, and MySQL",
      "Designed responsive and interactive UI using TailwindCSS and Figma",
      "Implemented dynamic reusable components (header, footer, posts) with vanilla JavaScript",
      "Focused on clean modular structure and maintainable code organization",
      "Integrated accessibility, responsive layouts, and modern UI animations"
    ],
    "url": "https://github.com/alealonso17/UniConnect"
  },
  {
    "name": "Deadline Hell",
    "startDate": "2025-11-14",
    "endDate": "2025-11-15",
    "isActive": true,
    "description": "A full-stack web application built in just one day to track university assessments, deadlines, and progress. Designed to help manage intense exam periods with a clean UI and fast workflow.",
    "highlights": [
      "Developed in 1 day from scratch",
      "Built with Node.js, Express, MySQL, TailwindCSS, and vanilla JavaScript",
      "Functional login, registration, and assessment creation",
      "Dynamic progress bars with backend updates",
      "Clean and minimal interface designed for productivity"
    ],
    "url": "https://github.com/alealonso17/Deadline-Hell"
  },
  {
    "name": "Wild Buddy",
    "startDate": "2024-02-01",
    "isActive": false,
    "endDate": "2024-02-02",
    "description": "Hackathon project app that analyzes, tracks and identifies animals, helping scientists, students and zookeepers.",
    "highlights": [
      "Developed computer vision and data analysis features",
      "Built under tight deadlines during RGU Hackathon",
      "Worked with data analysis libraries and machine learning models in Python"
    ],
    "url": "https://github.com/alealonso17/WildBuddy"
  },
  {
    "name": "Bakio Surf Cleaner",
    "startDate": "2025-01-01",
    "endDate": "2025-02-01",
    "isActive": false,
    "description": "Desktop app for surf school coaches to automatically remove short video clips from surf session recordings.",
    "highlights": [
      "Developed with Python",
      "Improved training efficiency by automating repetitive tasks"
    ],
    "url": "https://github.com/alealonso17/BakioSurf"
  }
]
